      ******************************************************************
      *                                                                *
      *  Copyright contributors to the CICS Banking Sample Application *
      * (CBSA) project                                                 *
      *                                                                *
      ******************************************************************
           03 GETSORTCODEOperation.
             06 SORTCODE pic xXXXXX.
