      ******************************************************************
      *                                                                *
      *  Copyright IBM Corp. 2023                                      *
      *                                                                *
      *                                                                *
      ******************************************************************
           03 GETSORTCODEOperation.
             06 SORTCODE pic xXXXXX.
