      ******************************************************************
      *                                                                *
      *  Copyright contributors to the CICS Banking Sample Application *
      * (CBSA) project                                                 *
      *                                                                *
      ******************************************************************
           05 Customer-Number-Key.
              10 CNO-KEY                  PIC 9(10) DISPLAY.
