      ******************************************************************
      *                                                                *
      *  Copyright IBM Corp. 2023                                      *
      *                                                                *
      *                                                                *
      ******************************************************************
           05 Customer-Number-Key.
              10 CNO-KEY                  PIC 9(10) DISPLAY.
