//*
//* Copyright IBM Corp. 2023       
//*
//* JCL to compile and link-edit BMS map BNK1DCM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1DCM  EXEC PROC=MAPGEN,MEMBER=BNK1DCM,RMODE=ANY,
//         OUTC='*'