//*
//* Copyright IBM Corp. 2023
//*
//* JCL to compile and link-edit BMS map BNK1UAM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1UAM  EXEC PROC=MAPGEN,MEMBER=BNK1UAM,RMODE=ANY,
//         OUTC='*'
