//*
//* Copyright IBM Corp. 2023
//*
//* JCL to compile and link-edit BMS map BNK1CAM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CAM  EXEC PROC=MAPGEN,MEMBER=BNK1CAM,RMODE=ANY,
//         OUTC='*'
