//*
//* Copyright IBM Corp. 2023       
//*
//* JCL to compile and link-edit BMS map BNK1CDM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CDM  EXEC PROC=MAPGEN,MEMBER=BNK1CDM,RMODE=ANY,
//         OUTC='*'