//*
//* Copyright IBM Corp. 2023       
//*
// SET CICSHLQ=DFH560.CICS
// SET CBSAHLQ=CBSA.CICSBSA
// SET LEHLQ=CEE
// SET COBOLHLQ=IGY630
// SET DB2HLQ=DSNC10