//*
//* Copyright IBM Corp. 2023       
//*
//TEST JOB ,CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
//*
//* ENMASS COMPILE JOB TO COMPILE ALL PROGRAMS IN CBSA
//*
//*  ABNDPROC
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=ABNDPROC
//*
//*  BANKDATA
// INCLUDE MEMBER=DEFAULT
// EXEC BATCH,MEMBER=BANKDATA
//*
//*  BNKMENU
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNKMENU
//*
//*  CRDTAGY1
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRDTAGY1
//*
//*  CRDTAGY2
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRDTAGY2
//*
//*  CRDTAGY3
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRDTAGY3
//*
//*  CRDTAGY4
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRDTAGY4
//*
//*  CRDTAGY5
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRDTAGY5
//*
//*  CREACC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CREACC
//*
//*  CREACC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CREACC
//*
//*  CRECUST
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CRECUST
//*
//*  CUSTCTRL
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=CUSTCTRL
//*
//*  DBCRFUN
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=DBCRFUN
//*
//*  DELACC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=DELACC
//*
//*  DELCUS
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=DELCUS
//*
//*  EXTDCUST
// JCLLIB ORDER=CTSSVT.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC BATCH,MEMBER=EXTDCUST
//*
//*  GETCOMPY
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=GETCOMPY
//*
//*  GETSCODE
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=GETSCODE
//*
//*  INQACC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=INQACC
//*
//*  INQACCCU
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=INQACCCU
//*
//*  INQCUST
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=INQCUST
//*
//*  NEWACCNO
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=NEWACCNO
//*
//*  NEWCUSNO
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=NEWCUSNO
//*
//*  PROCBRWS
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=PROCBRWS
//*
//*  UPDACC
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=UPDACC
//*
//*  UPDCUST
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=UPDCUST
//*
//*  XFRFUN
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=XFRFUN
//*
//*
//* START OF ASSEMBLED MAPS
//*  BNK1ACC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1ACC  EXEC PROC=MAPGEN,MEMBER=BNK1ACC,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1CAC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1CAC
//*
//*  BNK1CAM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CCM  EXEC PROC=MAPGEN,MEMBER=BNK1CAM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1CCA
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1CCA
//*
//*  BNK1CCM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CCM  EXEC PROC=MAPGEN,MEMBER=BNK1CCM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1CCS
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1CCS
//*
//*  BNK1CDM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CCM  EXEC PROC=MAPGEN,MEMBER=BNK1CDM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1CRA
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1CRA
//*
//*  BNK1DAC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1DAC
//*
//*  BNK1DAM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CCM  EXEC PROC=MAPGEN,MEMBER=BNK1DAM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1DCM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1CCM  EXEC PROC=MAPGEN,MEMBER=BNK1DCM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1DCS
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1DCS
//*
//*  BNK1MAI
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1MAI  EXEC PROC=MAPGEN,MEMBER=BNK1MAI,RMODE=ANY,
//         OUTC='*'
//*
//* BNK1TFM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1MAI  EXEC PROC=MAPGEN,MEMBER=BNK1TFM,RMODE=ANY,
//         OUTC='*'
//*
//*  BNK1TFN
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1TFN
//*
//*  BNK1UAC
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
// EXEC CICS,MEMBER=BNK1UAC
//*
//*  BNK1UAM
// JCLLIB ORDER=CBSA.CICSBSA.BUILDJCL
// INCLUDE MEMBER=DEFAULT
//BNK1MAI  EXEC PROC=MAPGEN,MEMBER=BNK1UAM,RMODE=ANY,
//         OUTC='*'
//*
//*
//*
//*    NOT SURE ABOUT THIS !
//*INCLUDE MEMBER=DEFAULT
//*EXEC CICS,MEMBER=ACCTCTRL